# join and append

In [3]:
import pandas as pd

In [5]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var2 = pd.DataFrame({"C":[10,20,30,40],"D":[21,22,33,44]})

In [7]:
var1.join(var2)

   A   B   C   D
0  1  11  10  21
1  2  12  20  22
2  3  13  30  33
3  4  14  40  44

In [11]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]})
var2 = pd.DataFrame({"C":[10,20],"D":[21,22]})

In [13]:
var1.join(var2)

   A   B     C     D
0  1  11  10.0  21.0
1  2  12  20.0  22.0
2  3  13   NaN   NaN
3  4  14   NaN   NaN

In [17]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[21,22]},index=["a","b"])

In [19]:
var1.join(var2)

   A   B     C     D
a  1  11  10.0  21.0
b  2  12  20.0  22.0
c  3  13   NaN   NaN
d  4  14   NaN   NaN

In [49]:
var1.join(var2, ignore_index=True)

TypeError: DataFrame.join() got an unexpected keyword argument 'ignore_index'

In [23]:
var2.join(var1)

    C   D  A   B
a  10  21  1  11
b  20  22  2  12

In [29]:
var2.join(var1, how = "inner")

    C   D  A   B
a  10  21  1  11
b  20  22  2  12

In [31]:
var2.join(var1, how = "left")

    C   D  A   B
a  10  21  1  11
b  20  22  2  12

In [33]:
var2.join(var1, how = "right")

      C     D  A   B
a  10.0  21.0  1  11
b  20.0  22.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

In [35]:
var2.join(var1, how = "outer")

      C     D  A   B
a  10.0  21.0  1  11
b  20.0  22.0  2  12
c   NaN   NaN  3  13
d   NaN   NaN  4  14

In [37]:
var2.join(var1, how = "inner", lsuffix="_12")

    C   D  A   B
a  10  21  1  11
b  20  22  2  12

In [39]:
var2.join(var1, how = "inner", lsuffix="_12", rsuffix="_123")

    C   D  A   B
a  10  21  1  11
b  20  22  2  12

In [43]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index=["a","b","c","d"])
var2 = pd.DataFrame({"C":[10,20],"D":[21,22]},index=["a","b"])

In [47]:
var1.concat(var2)

AttributeError: 'DataFrame' object has no attribute 'concat'